# streamlit_app.py

import streamlit as st

st.title("김영현 자기소개서")

st.header("🙋‍♀️ 자기소개")
st.markdown("""

안녕하세요. 저는 건양대병원에서 안전관리자로 근무하고 있는 김영현입니다.  
원무팀에서 병원 경력을 시작하였고 물류자산팀을 거쳐 현재는 안전보건팀에서 일을 하고 있습니다.  
직무에 필요한 역량을 채우기 위해 꾸준히 자격증을 취득했고, 2025년 1학기에 재난안전소방학과 대학원 과정에 진학하였습니다.  
배우고 도전하는 것을 좋아하며, 조금씩 성장해나가는 중입니다.  
MBTI는 ESTP로, 유연하고 현실적인 시각을 바탕으로 문제를 해결하고 사람들과의 소통을 즐깁니다. 일상 속 재미와 변화를 추구하며, 실행력이 강한 편입니다.


<br><br>
""")

st.header("📚 경력 및 자격")
st.markdown("""

- 2017: 컴퓨터활용능력 2급 취득
- 2018: 비서 1급, 유통관리사 2급 취득
- 2020: 산업안전기사 취득
- 2022~현재: 대학병원 안전관리자로 직무 전환
- 2024: 소방설비기사(전기) 취득
- 2025: 인간공학기사, 소방안전관리자1급 취득
- 목표: 소방설비기사(기계) 준비 예정
**직장에 다니면서 취득한 자격증입니다**


<br><br>
""")

st.header("💡 요즘 나의 관심사")
st.markdown("""

- 학술대회 논문을 작성 하였고 한국산학기술학회 춘계학술대회에서 발표하였습니다. 추후 석사 졸업 논문으로까지 발전시키려고 합니다. (주제: 병원 내 정수기 주변의 환자 넘어짐 사고 방지 방안에 관한 연구)
- 독서를 좋아하여 가입한 독서 모임에서 모임장까지 맡게되어 약 3년 6개월 동안 운영 중 입니다.
- 헬스(웨이트), 등산, 달리기 등 활동적인 운동을 즐깁니다.
- 한화이글스(야구)의 팬으로 최소 월1회 직관을 다니고 응원하는 것을 좋아합니다.
- 최근에 운전을 시작하여 운전이 재밌을 때여서 여기저기 드라이브를 즐기는 중 입니다.
- 코바늘로 네잎클로버, 키링, 티코스터 등을 떠서 주변 지인들에게 선물하고 그들이 행복해하는 모습을 보는 것을 좋아합니다.


<br><br>
""")

st.header("🔥 나의 좌우명")
st.write("“JUST DO IT”")
st.write("“나는 어떤 일을 시작하는 '반드시 된다'는 확신 90%에 '되게 할 수 있다'는 자신감 10%로 완벽한 100%를 채우지, 안될 수도 있다는 회의나 불안은 단 1%도 끼워넣지 않는다 -이땅에 태어나서 나의 살아온 이야기 정주영 中-”")

