# streamlit_app.py

import streamlit as st

st.title("김영현 자기소개서")

st.header("🙋‍♀️ 자기소개")
st.markdown("""

안녕하세요. 저는 건양대병원에서 안전관리자로 근무하고 있는 김영현입니다.  
원무팀에서 병원 경력을 시작하였고 물류자산팀을 거쳐 현재는 안전보건팀에서 일을 하고 있습니다.  
직무에 필요한 역량을 채우기 위해 꾸준히 자격증을 취득했고, 2025년 1학기에 재난안전소방학과 대학원 과정에 진학하였습니다.  
배우고 도전하는 것을 좋아하며, 조금씩 성장해나가는 중입니다.  
MBTI는 ESTP로, 유연하고 현실적인 시각을 바탕으로 문제를 해결하고 사람들과의 소통을 즐깁니다. 일상 속 재미와 변화를 추구하며, 실행력이 강한 편입니다.



""")

st.header("📚 경력 및 자격")
st.markdown("""

- 2017: 컴퓨터활용능력 2급 취득
- 2018: 비서 1급, 유통관리사 2급 취득
- 2020: 산업안전기사 취득
- 2022~현재: 대학병원 안전관리자로 직무 전환
- 2024: 소방설비기사(전기) 취득
- 2025: 인간공학기사, 소방안전관리자1급 취득
- 목표: 소방설비기사(기계) 준비 예정
**직장에 다니면서 취득한 자격증입니다**


""")

st.header("💡 나의 관심사 및 취향")
st.markdown("""

- 학술대회 논문을 작성 하였고 한국산학기술학회 춘계학술대회에서 발표하였습니다. 추후 석사 졸업 논문으로까지 발전시키려고 합니다. 
  (주제: 병원 내 정수기 주변의 환자 넘어짐 사고 방지 방안에 관한 연구)
- 독서를 좋아하여 가입한 독서 모임에서 모임장까지 맡게되어 약 3년 6개월 동안 운영 중 입니다.
  가장 좋아하는 분야는 소설과 자기계발서이고 시, 에세이, 경제학 관련 도서는 좋아하지 않으나 다양하게 읽으려 노력 중 입니다.
- 운동을 좋아하여 필라테스와 요가, 복싱, 유도, 클라이밍 등 다양한 운동을 체험해보았습니다.
  그 중에서 가장 잘 맞는 운동은 헬스(웨이트), 등산, 달리기 등의 활동적인 운동입니다.
  한창 운동에 빠져있을 때 주7일 운동을 할 정도였고 점차 들 수 있는 무게가 늘어나는 것이 좋아서 웨이트를 가장 즐겨합니다.
  무게 욕심을 부리다가 허리를 삐끗해서 오랫동안 헬스를 쉬다가 최근에 다시 시작하였습니다.
- 한화이글스(야구)의 팬으로 최소 월1회 직관을 다니고 응원하는 것을 좋아해서 주로 응원석으로 가곤합니다.
  좋아하는 선수들은 그때그때 잘하는 선수이고 유니폼 마킹은 노시환입니다.
- 최근에 운전을 시작하여 운전이 재밌을 때여서 여기저기 드라이브를 즐기는 중 입니다.
  아직 고속도로는 무서워서 경험하지 못하고 외곽 위주로 다니고 있습니다.
- 손으로 뭔가를 만드는 것을 좋아하고 요즘은 코바늘을 즐겨합니다.
  코바늘로 네잎클로버, 키링, 티코스터 등을 떠서 주변 지인들에게 선물하고 그들이 행복해하는 모습을 보는 것을 좋아합니다.
- 영화는 액션, 인도영화, 디즈니를 좋아하고 가장 좋아하는 영화는 존윅 입니다.



""")

st.header("🔥 나의 좌우명")
st.write("“JUST DO IT”")
st.write("“나는 어떤 일을 시작하는 '반드시 된다'는 확신 90%에 '되게 할 수 있다'는 자신감 10%로 완벽한 100%를 채우지, 안될 수도 있다는 회의나 불안은 단 1%도 끼워넣지 않는다 -이땅에 태어나서 나의 살아온 이야기 정주영 中-”")
st.markdown("""
어떤 일이든 열정적으로 하려고 노력합니다. 재밌어보이면 생각대신 행동으로 옮기는 편이고 지금까지 선택한 일에 대해 후회는 하지 않습니다.
모든 것을 경험이라 생각하고 도전하는 정신으로 즐겁게 살고 있습니다.

이상 김영현 자기소개를 마치겠습니다. 들어주셔서 감사합니다
""")
